import Headline from "@/components/headline";
import { Link } from "@/components/link";
import { description, images } from "@/constants";
import { Metadata } from "next";

const title = "VtuberThaiInfo.com - นโยบายการใช้คุกกี้ | Cookie Policy."

export const metadata: Metadata = {
  metadataBase: new URL(process.env.NEXT_PUBLIC_BASE_URL!),
  title,
  description,
  openGraph: {
    title,
    description,
    images,
  },
  twitter: {
    card: "summary_large_image",
    title,
    description,
    images,
  },
  robots: { index: false, follow: false },
};

export default function Privacy() {
  return (
    <div className="flex flex-col text-primary items-center p-4 gap-4 container self-center bg-white">
      <Headline
        title={<h1 className="flex gap-2">นโยบายการใช้คุกกี้ (Cookie Policy)</h1>}
      />
      <article className="prose max-w-full shadow-inner bg-primary/10 rounded-xl p-4 ">
        <p>
          เว็บไซต์ VtuberThaiInfo.com มีการใช้งานเทคโนโลยีคุกกี้ หรือ
          เทคโนโลยีอื่นที่มีลักษณะใกล้เคียงกันกับคุกกี้ บนเว็บไซต์ของเรา
          เพื่อให้ผู้เยี่ยมชมเว็บไซต์ ได้รับประสบการณ์ที่ดีในการเยี่ยมชมเว็บไซต์
          และ ช่วยให้เราพัฒนาระบบเว็บไซต์
          ที่สามารถตอบสนองความต้องการของผู้เยี่ยมชมได้อย่างดียิ่งขึ้น
        </p>

        <h2>คำจำกัดความ</h2>
        <p>
          ผู้เยี่ยมชมเว็บไซต์ คือ ผู้ที่เปิดหน้าเว็บไซต์ หรือ
          อ่านข้อมูลบนหน้าเว็บไซต์ ไม่ว่าจะเป็นหน้าใดก็ตาม
        </p>
        <p>ระบบเว็บไซต์ คือ ระบบการทำงานของเว็บไซต์ VtuberThaiInfo.com</p>

        <h2>คุกกี้ คือ อะไร</h2>
        <p>
          คุกกี้ คือ
          ไฟล์ข้อความขนาดเล็กที่จัดเก็บอยู่บนเครื่องคอมพิวเตอร์ของผู้เยี่ยมชมเว็บไซต์
          เมื่อมีการเข้าสู่เว็บไซต์ และ
          ในแต่ละครั้งที่ผู้เยี่ยมชมเว็บไซต์เข้าสู่หน้าใดของเว็บไซต์ก็ตาม
          ข้อมูลในคุกกี้ จะถูกส่งกลับไปยังระบบเว็บไซต์เพื่อประมวลผล หรือ
          ถูกส่งต่อไปยังเว็บไซต์อื่นๆ ที่รองรับการทำงานของคุกกี้นั้นได้
        </p>
        <p>
          คุกกี้มีประโยชน์ในการช่วยให้ระบบเว็บไซต์
          สามารถจดจำอุปกรณ์ของผู้เยี่ยมชมเว็บไซต์
          เพื่อให้บริการที่เหมาะสมกับผู้เยี่ยมชมเว็บไซต์ มากยิ่งขึ้น
        </p>
        <p>
          คุกกี้ สามารถทำงานได้หลากหลายแบบ เช่น
          ช่วยให้ผู้เยี่ยมชมเว็บไซต์ได้รับประสบการณ์ที่เหมาะสมในการเยี่ยมชมเว็บไซต์
          สำหรับแต่ละอุปกรณ์ จดจำสิ่งที่ผู้เยี่ยมชมเว็บไซต์ชื่นชอบ
          และพัฒนาประสบการณ์การใช้งานของผู้เยี่ยมชมเว็บไซต์
        </p>
        <p>
          นอกจากนี้ คุกกี้ที่ VtuberThaiInfo.com ใช้ยังสามารถแบ่งเป็นประเภทต่างๆ
          ได้ดังนี้
        </p>

        <p className="pl-10">
          <h3>คุกกี้ที่จำเป็นต่อการใช้งานเว็บไซต์</h3>
          <p>
            คุกกี้ประเภทนี้ มีความสำคัญ ในการทำให้ผู้เยี่ยมชมเว็บไซต์
            สามารถใช้งานเว็บไซต์ และ ฟังก์ชั่นต่างๆ บนเว็บไซต์ของเราได้
            รวมถึงช่วยให้ผู้เยี่ยมชมเว็บไซต์ สามารถเข้าถึงข้อมูล และ ใช้เว็บไซต์
            ได้อย่างปลอดภัย หากไม่มีคุกกี้ประเภทนี้ เว็บไซต์ VtuberThaiInfo.com
            จะไม่สามารถทำงานได้อย่างปกติ รวมทั้งผู้เยี่ยมชมเว็บไซต์
            จะไม่สามารถใช้บริการบางอย่างบนเว็บไซต์ VtuberThaiInfo.com ได้
          </p>
          <h3>คุกกี้ที่ใช้ประมวลผลสถิติและวิเคราะห์การใช้งานเว็บไซต์</h3>
          <p>
            คุกกี้ประเภทนี้ ใช้สำหรับประมวลผลการดำเนินงานของเว็บไซต์
            VtuberThaiInfo.com เพื่อให้ระบบเว็บไซต์
            เข้าใจถึงความสนใจของผู้เยี่ยมชมเว็บไซต์ เช่น
            การนับจำนวนผู้เข้าชมเว็บไซต์
            การนับจำนวนหน้าที่ผู้เยี่ยมชมเว็บไซต์เข้าใช้งาน
            การประมวลผลความสนใจและพฤติกรรมการเยี่ยมชมเว็บไซต์ โดยทางเว็บไซต์
            VtuberThaiInfo.com จะใช้ข้อมูลดังกล่าว
            เพื่อปรับปรุงประสิทธิภาพการทำงานของเว็บไซต์
            เพื่อตอบสนองต่อความต้องการของผู้เยี่ยมชมเว็บไซต์
            ให้สามารถใช้งานเว็บไซต์ได้ดียิ่งขึ้น
          </p>
          <h3>คุกกี้ที่ใช้สำหรับการตลาดออนไลน์</h3>
          <p>
            คุกกี้ประเภทนี้จะถูกใช้งานเพื่อเก็บข้อมูลการใช้งานเว็บไซต์ และ
            ลิงก์ที่ผู้เยี่ยมชมเว็บไซต์มีการเข้าถึงหรือเยี่ยมชม
            เพื่อให้เข้าใจในความสนใจและพฤติกรรมการเยี่ยมชมเว็บไซต์
            ของผู้เยี่ยมชมเว็บไซต์ และ ใช้ในการนำเสนอสิทธิประโยชน์ โฆษณา และ
            ประชาสัมพันธ์ ให้เหมาะสมกับความสนใจของผู้เยี่ยมชมเว็บไซต์มากที่สุด
          </p>
        </p>

        <h2>การตั้งค่าและการปฏิเสธคุกกี้</h2>
        <p>
          ในการใช้บริการเว็บไซต์ VtuberThaiInfo.com ผู้เยี่ยมชมเว็บไซต์
          รับทราบว่าเว็บไซต์ VtuberThaiInfo.com จะมีการใช้งานคุกกี้ประเภทต่างๆ
          เพื่อวัตถุประสงค์ตามที่ระบุไว้ข้างต้น และระบบเว็บไซต์ อาจเก็บรวบรวม
          ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของผู้เยี่ยมชมเว็บไซต์
          ซึ่งเป็นส่วนหนึ่งของคุกกี้ดังกล่าว
          เพื่อวัตถุประสงค์ตามที่ระบุไว้ในประกาศนโยบายความเป็นส่วนตัวของเว็บไซต์
        </p>
        <p>
          หากเว็บไซต์ VtuberThaiInfo.com
          มีการเชื่อมโยงไปยังเว็บไซต์ของบุคคลที่สาม
          โปรดทราบว่าบุคคลดังกล่าวอาจมีนโยบายการใช้คุกกี้ของตนเอง
          เราขอแนะนำให้ผู้เยี่ยมชมเว็บไซต์ทุกท่าน
          อ่านนโยบายการใช้คุกกี้ของบุคคลดังกล่าวก่อนการใช้งานเว็บไซต์เหล่านั้น
        </p>

        <h2>ข้อตกลงการใช้บริการเว็บไซต์</h2>
        <p>
          ผู้เยี่ยมชมเว็บไซต์ สามารถเลือกทำการปฎิเสธการทำงานของคุ้กกี้
          ได้ตามความต้องการ โดยสามารถตั้งค่าเว็บบราวเซอร์ หรือ
          ค่าความเป็นส่วนตัวของผู้เยี่ยมชมเว็บไซต์
          ด้วยการปฏิเสธการทำงานของคุ้กกี้ทั้งหมด แต่ทั้งนี้ผู้เยี่ยมชมเว็บไซต์
          จะไม่สามารถใช้งานบางฟังก์ชั่นบนเว็บไซต์ได้ และ
          อาจจะทำให้การใช้งานเว็บไซต์ไม่มีประสิทธิภาพเท่าที่ควร
        </p>
        <p>
          นอกจากการตั้งค่าความเป็นส่วนตัวบนอุปกรณ์ หรือ เว็บบราวเซอร์โดยตรงแล้ว
          ผู้เยี่ยมชมเว็บไซต์
          ยังสามารถปฏิเสธคุกกี้ผ่านทางหน้าต่างแจ้งเตือนบนหน้าเว็บไซต์ได้อีกด้วย
          แต่ถ้าหากผู้เยี่ยมชมเว็บไซต์ปฏิเสธการใช้งานคุกกี้ทั้งหมด
          ผู้เยี่ยมชมเว็บไซต์ จะไม่สามารถใช้งานบางฟังก์ชั่นบนเว็บไซต์ได้ และ
          อาจจะทำให้ประสบการณ์การใช้งานเว็บไซต์ไม่มีประสิทธิภาพเท่าที่ควร
        </p>

        <h2>
          ท่านจะติดต่อ VtuberThaiInfo.com และเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล
          ได้อย่างไร
        </h2>
        <p>
          หากท่านมีข้อเสนอแนะ
          หรือต้องการสอบถามข้อมูลเกี่ยวกับรายละเอียดการเก็บรวบรวม ใช้
          และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
          รวมถึงการขอใช้สิทธิตามนโยบายฉบับนี้ ท่านสามารถติดต่อ
          ผ่านช่องทางต่อไปนี้
        </p>
        <ul>
          <li>
            <Link  href={"https://twitter.com/RikiNozomu"} target="_blank">
              Twitter: @RikiNozomu
            </Link>
          </li>
        </ul>

        <b>จัดทำนโยบายโดย VtuberThaiInfo</b>
      </article>
    </div>
  );
}
