import Headline from "@/components/headline";
import { Link } from "@/components/link";
import { description, images } from "@/constants";
import { Metadata } from "next";

const title = "VtuberThaiInfo.com - นโยบายความเป็นส่วนตัวของข้อมูล | Privacy Policy."

export const metadata: Metadata = {
  metadataBase: new URL(process.env.NEXT_PUBLIC_BASE_URL!),
  title,
  description,
  openGraph: {
    title,
    description,
    images,
  },
  twitter: {
    card: "summary_large_image",
    title,
    description,
    images,
  },
  robots: { index: false, follow: false },
};

export default function Privacy() {
  return (
    <div className="flex flex-col text-primary items-center p-4 gap-4 container self-center bg-white">
      <Headline
        title={<h1 className="flex gap-2">นโยบายความเป็นส่วนตัวของข้อมูล (Privacy Policy)</h1>}
      />
      <article className="prose max-w-full shadow-inner bg-primary/10 rounded-xl p-4 ">
        <p>
          เว็บไซต์ของเรา VtuberThaiInfo.com
          เคารพสิทธิความเป็นส่วนตัวของผู้ใช้ทุกคนที่เข้าเว็บไซต์ของเรา
          จึงขอชี้แจงให้ท่านทราบเกี่ยวกับการใช้งานข้อมูลส่วนบุคคลของท่าน
        </p>
        <p>ประกาศนโยบายความเป็นส่วนตัวนี้ใช้สำหรับบุคคลดังต่อไปนี้</p>
        <p>
          ผู้ให้บริการหรือเจ้าของเว็บไซต์ ต่อไปนี้จะเรียกว่า VtuberThaiInfo.com
        </p>
        <p>
          ผู้เยี่ยมชมเว็บไซต์ คือ ผู้ที่เปิดหน้าเว็บไซต์ หรือ
          อ่านข้อมูลบนหน้าเว็บไซต์ VtuberThaiInfo.com ไม่ว่าจะเป็นหน้าใดก็ตาม
        </p>
        <p>
          เว็บไซต์ VtuberThaiInfo.com
          ได้กำหนดนโยบายเกี่ยวกับข้อมูลส่วนบุคคลเพื่อยกระดับมาตรฐาน ความปลอดภัย
          ของข้อมูลส่วนบุคคล ของผู้เยี่ยมชม และ
          ผู้ใช้บริการเว็บไซต์ให้ดียิ่งขึ้น และ เพื่อให้สอดคล้องกับพระราชบัญญัติ
          คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
        </p>
        <p>
          ดังนั้น เราขอแนะนำให้ท่านอ่านนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้
          เพื่อเรียนรู้และเข้าใจหลักปฏิบัติที่เว็บไซต์ VtuberThaiInfo.com
          ยึดถือในการปฏิบัติต่อข้อมูลส่วนบุคคลของท่าน
        </p>

        <h2>วัตถุประสงค์ของการจัดเก็บข้อมูลส่วนบุคคล</h2>
        <p>
          VtuberThaiInfo.com เก็บข้อมูลส่วนบุคคลของท่านตามวัตถุประสงค์
          ของการดำเนินงานเว็บไซต์ดังนี้
        </p>
        <ul>
          <li>เพื่อใช้ในกิจกรรมทางการตลาดออนไลน์ และ การโฆษณา</li>
          <li>
            เพื่อใช้ในวิเคราะห์ข้อมูลผู้เยี่ยมชมเว็บไซต์ และ วิจัยทางการตลาด
          </li>
          <li>
            เพื่อใช้ในการพัฒนาเว็บไซต์ และ
            มอบประสบการณ์เฉพาะบุคคลใหักับผู้เยี่ยมชมเว็บไซต์
          </li>
          <li>การใช้งานคุกกี้บนเว็บไซต์ VtuberThaiInfo.com</li>
        </ul>
        <p>
          เว็บไซต์ VtuberThaiInfo.com มีการใช้งานคุกกี้
          เพื่อวัตถุประสงค์ทางการดำเนินงานของเว็บไซต์
          ท่านสามารถศึกษาข้อมูลเพิ่มเติมเกี่ยวกับ
          นโยบายการใช้งานคุกกี้บนเว็บไซต์ VtuberThaiInfo.com ได้จาก{" "}
          <Link  href="/cookie">นโยบายการใช้คุกกี้ (Cookie Policy)</Link> ของเรา
        </p>

        <h2>ข้อมูลส่วนบุคคลที่จัดเก็บโดย บุคคลที่สาม</h2>
        <p>
          เว็บไซต์ VtuberThaiInfo.com มีการใช้งาน ซอฟท์แวร์ และ บริการจาก
          บุคคลที่สาม สำหรับเพิ่มประสิทธิภาพการทำงานของเว็บไซต์
          โดยบริการที่เว็บไซต์ใช้มีดังนี้
        </p>
        <ul>
          <li>Google Analytics</li>
          <li>Google hTag Manager</li>
        </ul>
        <p>
          กรณีที่มีการเชื่อมโยงกับแพลตฟอร์มของบุคคลที่สาม เช่น เครือข่ายการโฆษณา
          สื่อสังคมออนไลน์ ผู้ให้บริการเว็บไซต์ภายนอกอื่นๆ คุกกี้บางประเภท และ
          ข้อมูลจราจรทางคอมพิวเตอร์ อาจมีการจัดการโดยบุคคลที่สาม
          จึงแนะนำให้ผู้เยี่ยมชมเว็บไซต์
          ศึกษาและทำความเข้าใจนโยบายการใช้คุกกี้และนโยบายการคุ้มครองข้อมูลส่วนบุคคลของบุคคลที่สามเพิ่มเติมด้วย
        </p>

        <h2>สิทธิของเจ้าของข้อมูลส่วนบุคคล</h2>
        <p>
          ผู้เยี่ยมชมเว็บไซต์ สามารถปฎิเสธ การใช้งานคุกกี้ ได้จาก
          หน้าต่างแจ้งเตือนการใช้งานคุกกี้ ที่หน้าเว็บไซต์
        </p>
        <p>
          ผู้เยี่ยมชมเว็บไซต์ สามารถลบข้อมูลคุกกี้ทั้งหมด
          ได้จากเว็บบราวเซอร์ที่ผู้เยี่ยมชมเว็บไซต์ ใช้งาน
          โดยท่านสามารถศึกษาวิธีการลบคุกกี้ ออกจากเว็บบราวเซอร์
          จากเว็บไซต์ของผู้พัฒนาเว็บบราวเซอร์นั้น
        </p>

        <h2>ความปลอดภัยของข้อมูลส่วนบุคคล</h2>
        <p>
          บนเว็บไซต์ VtuberThaiInfo.com อาจจะมีลิงก์เชื่อมโยงไปยังเว็บไซต์อื่นๆ
          หรือท่านอาจใช้ลิงก์ในเว็บไซต์อื่นเพื่อเข้ามาในเว็บไซต์ของเรา
          เราขอให้ท่านเข้าใจว่า เว็บไซต์ VtuberThaiInfo.com
          ไม่สามารถที่จะรับผิดชอบต่อนโยบาย
          และวิธีการปฏิบัติเกี่ยวกับการคุ้มครองความเป็นส่วนตัวของเว็บไซต์อื่นๆได้
          ดังนั้นขอให้ท่านศึกษา นโยบาย และ
          แนวทางปฏิบัติเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล ของเว็บไซต์
          ที่ท่านเยี่ยมชม
          ก่อนและหลังเยี่ยมชมเว็บไซต์ของเราผ่านลิงก์เชื่อมโยงบนเว็บไซต์ด้วย
        </p>
        <p>
          อย่างไรก็ตามเว็บไซต์ VtuberThaiInfo.com ไม่สามารถที่จะควบคุมดูแล
          หรือรับผิดชอบต่อการใช้ข้อมูลส่วนตัวโดยบุคคลภายนอก หรือ องค์กรภายนอก
          ที่ได้รับข้อมูลจากท่านผ่านทางเว็บไซต์นี้ เราจึงขอแนะนำให้ท่านพิจารณา
          การยอมรับหรือการปฏิเสธการใช้งานคุกกี้ จากบุคคลที่สาม
          ตามที่เราได้แจ้งข้างต้นถึงสิทธิที่ท่านสามารถปฏิเสธการใช้งานคุกกี้เหล่านี้ได้ด้วยตนเอง
        </p>

        <h2>
          ท่านจะติดต่อ VtuberThaiInfo.com และเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล
          ได้อย่างไร
        </h2>
        <p>
          หากท่านมีข้อเสนอแนะ
          หรือต้องการสอบถามข้อมูลเกี่ยวกับรายละเอียดการเก็บรวบรวม ใช้
          และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
          รวมถึงการขอใช้สิทธิตามนโยบายฉบับนี้ ท่านสามารถติดต่อ
          ผ่านช่องทางต่อไปนี้
        </p>
        <ul>
          <li>
            <Link  href={"https://twitter.com/RikiNozomu"} target="_blank">
              Twitter: @RikiNozomu
            </Link>
          </li>
        </ul>

        <b>จัดทำนโยบายโดย VtuberThaiInfo</b>
      </article>
    </div>
  );
}
